Autodesk.Revit.DB.Structure.StructuralType
Represents the structural type of a family instance.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralType.UnknownFraming
Unknown Framing

Autodesk.Revit.DB.Structure.StructuralType.Footing
Structural Footing

Autodesk.Revit.DB.Structure.StructuralType.Column
Structural Column

Autodesk.Revit.DB.Structure.StructuralType.Brace
Structural Brace

Autodesk.Revit.DB.Structure.StructuralType.Beam
Structural Beam

Autodesk.Revit.DB.Structure.StructuralType.NonStructural
Non-Structural